In [1]:
import pandas as pd

# Series

In [2]:
data = list(range(1,6))

In [3]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ['linha' + str(i) for i in range(5)]
s = pd.Series(data,index=index)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [7]:
data = {'Linha'+str(i):i + 1 for i in range(5)}
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [8]:
s1 = s+2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [9]:
s2 = s1 +s
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [10]:
data = [[1,2,3],[7,4,5],[10,105,11]]

In [11]:
df = pd.DataFrame(data)
df

    0    1   2
0   1    2   3
1   7    4   5
2  10  105  11

In [13]:
index = ['linha' + str(i) for i in range(3)]
columns = ['coluna' + str(i) for i in range(3)]
df = pd.DataFrame(data,index=index,columns=columns)
df

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        7        4        5
linha2       10      105       11

In [14]:
data = {'Coluna' + str(i):{'Linha' + str(j):3*j + i+1 for j in range(3)} for i in range(3)}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [15]:
df = pd.DataFrame(data)
df

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [16]:
df1 = df.copy()
df2 = df.copy()

In [17]:
df[df>0] = 'A'
df1[df1>0] = 'B'
df2[df2>0] = 'C'

In [18]:
df3 = pd.concat([df,df1,df2])
df3

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [19]:
df3 = pd.concat([df,df1,df2],axis=1)
df3

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C